fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция АнализОтпусковНаСервере()
	
	Запрос = Новый Запрос;
Запрос.Текст =
"ВЫБРАТЬ
|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
|ИЗ
|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
|ГДЕ
|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";

Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

ДанныеДляГанта = Новый Массив;

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
	СтруктураДляГанта = Новый Структура();
	СтруктураДляГанта.Вставить("Год", Объект.Год);
	СтруктураДляГанта.Вставить("Сотрудник",ВыборкаДетальныеЗаписи.Сотрудник);
	СтруктураДляГанта.Вставить("ДатаНачала",ВыборкаДетальныеЗаписи.ДатаНачала);
	СтруктураДляГанта.Вставить("ДатаОкончания",ВыборкаДетальныеЗаписи.ДатаОкончания);
	ДанныеДляГанта.Добавить(СтруктураДляГанта);

КонецЦикла;

Адрес = ПоместитьВоВременноеХранилище(ДанныеДляГанта,Адрес);

Возврат Адрес;

КонецФункции

&НаКлиенте
Процедура АнализОтпусков(Команда)
	
	Адрес = АнализОтпусковНаСервере();
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Адрес", Адрес);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика",СтруктураПараметров);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

Запрос = Новый Запрос;
Запрос.Текст =
"ВЫБРАТЬ
|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
|	СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала,
|		ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, День) + 1) КАК ОтпускныхДней
|ИЗ
|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
|ГДЕ
|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
|СГРУППИРОВАТЬ ПО
|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник";

Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
	Если ВыборкаДетальныеЗаписи.ОтпускныхДней > 28 Тогда
		
		ПараметрОтбора = Новый Структура("Сотрудник", ВыборкаДетальныеЗаписи.Сотрудник);
		НайденныеСтроки = Объект.ОтпускаСотрудников.НайтиСтроки(ПараметрОтбора);
		
		Для Каждого Строка Из НайденныеСтроки Цикл
			
			СтрокаТЧ = Объект.ОтпускаСотрудников[Строка.НомерСтроки -1];
			СтрокаТЧ.КоличествоДнейОтпуска = ВыборкаДетальныеЗаписи.ОтпускныхДней;
			
		КонецЦикла;
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтрШаблон("У сотрудника %1, суммарное количество отпускных дней более 28", ВыборкаДетальныеЗаписи.Сотрудник);
		Сообщение.Сообщить();
		
	КонецЕсли;

КонецЦикла;

КонецПроцедуры
